fullstack-test/welink-test-backend/app/controllers/api/v1/feedbacks_controller.rb

INSERT INTO "feedbacks" ("user_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", "50b0017b-dfa5-4e87-99b0-93817e83587e"], ["body", "test"], ["created_at", "2021-05-16 22:50:48.683115"], ["updated_at", "2021-05-16 22:50:48.683115"]]
INSERT INTO "users" ("firstname", "lastname", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["firstname", "Jesusita"], ["lastname", "Corkery"], ["email", "santos.ward@feeney.org"], ["created_at", "2021-05-16 22:50:48.666981"], ["updated_at", "2021-05-16 22:50:48.666981"]]
---
  def create
    if user.id
      user.update(user_params)
    else
      user.assign_attributes(user_params)
    end

    new_feedback = Feedback.new(body: feedback_params[:body], user: user)

    if new_feedback.save && user.save